KunYi/nRF5_SDK_Thread/examples/multiprotocol/ble_thread/ble_thread_swi_mtd_coap_cli/main.c
static otNetifAddress m_slaac_addresses[NUM_SLAAC_ADDRESSES];                       /**< Buffer containing addresses resolved by SLAAC */

static uint16_t       m_conn_handle          = BLE_CONN_HANDLE_INVALID;             /**< Handle of the current connection. */
static uint16_t       m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;        /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t     m_adv_uuids[]          =                                      /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};


APP_TIMER_DEF(m_thread_timeout);                                                    /**< Timer used to expire Thread connection in case of attachment failure. */

static volatile enum
{
    CONNECTION_STATE_IDLE,                                                          /**< The application is in the idle state. */
    CONNECTION_STATE_BLE,                                                           /**< The application is in the BLE mode. */
    CONNECTION_STATE_BLE_DISCONNECT,                                                /**< The application is scheduled to be disconnected from BLE connection. */
    CONNECTION_STATE_BLE_DISCONNECTING,                                             /**< The application is disconnecting from its BLE connection. */
    CONNECTION_STATE_BLE_DISABLE,                                                   /**< The application is disabling BLE mode. */
    CONNECTION_STATE_THREAD_ATTACH,                                                 /**< The application is attaching to a Thread network. */
    CONNECTION_STATE_THREAD_SEND,                                                   /**< The application is attached to a Thread network and requests sending a CoAP command. */
    CONNECTION_STATE_THREAD_SENT,                                                   /**< The application has requested sending a CoAP command. */
    CONNECTION_STATE_THREAD_DISABLE,                                                /**< The application is disabling Thread mode. */
} m_connection_state;                                                               /**< State of the application. */


static void switch_ble_to_thread(void);
static void switch_thread_to_ble(void);
static void thread_message_start_sending(void);


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        if (p_evt->params.rx_data.length == strlen(LED_STRING) &&
            strncmp((char *)p_evt->params.rx_data.p_data, LED_STRING, strlen(LED_STRING)) == 0)
        {
            thread_message_start_sending();
        }
    }
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;
    ble_nus_init_t nus_init;

    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

