KunYi/nRF5_SDK_Thread/examples/multiprotocol/ble_thread/ble_thread_swi_mtd_coap_cli/main.c
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, 64);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_KEY_2:
            thread_message_start_sending();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    switch (m_connection_state)
    {
    case CONNECTION_STATE_IDLE:
    case CONNECTION_STATE_BLE_DISABLE:
        break;

    case CONNECTION_STATE_BLE:
    case CONNECTION_STATE_BLE_DISCONNECT:
    case CONNECTION_STATE_BLE_DISCONNECTING:
    {
        uint32_t err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
        break;
    }

    case CONNECTION_STATE_THREAD_ATTACH:
    case CONNECTION_STATE_THREAD_SEND:
    case CONNECTION_STATE_THREAD_SENT:
    case CONNECTION_STATE_THREAD_DISABLE:
        if (!otTaskletsArePending(thread_ot_instance_get()) &&
            (otPlatRadioGetState(thread_ot_instance_get()) == OT_RADIO_STATE_SLEEP ||
             otPlatRadioGetState(thread_ot_instance_get()) == OT_RADIO_STATE_DISABLED))
        {
            __WFE();
        }
        break;
    }
}


/**@brief Disable BLE stack.
 */
static void ble_stack_deinit(void)
{
    uint32_t err_code;

    err_code = ble_conn_params_stop();
    APP_ERROR_CHECK(err_code);

    err_code = nrf_sdh_disable_request();
    APP_ERROR_CHECK(err_code);

    // Neither SoftDevice clears clock events after disabling, nor clock driver before enabling.
    // When the clock driver is enabled there is a pending event in the clock peripheral that leads
    // to incorrect state of the driver. Following workaround prevents this problem.
    nrf_clock_event_clear(NRF_CLOCK_EVENT_HFCLKSTARTED);

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function called when the Thread node changes it's state.
 */
static void thread_state_changed_callback(uint32_t aFlags, void *aContext)
{
    uint32_t err_code;

    if (aFlags & OT_CHANGED_THREAD_ROLE)
    {
        switch (otThreadGetDeviceRole(aContext))
        {
        case OT_DEVICE_ROLE_DETACHED:
        case OT_DEVICE_ROLE_DISABLED:
            err_code = bsp_indication_set(BSP_THREAD_ENABLE);
            APP_ERROR_CHECK(err_code);
            break;

        case OT_DEVICE_ROLE_CHILD:
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);

            if (m_connection_state == CONNECTION_STATE_THREAD_ATTACH)
            {
                m_connection_state = CONNECTION_STATE_THREAD_SEND;
            }
            break;

        default:
            break;
        }
    }

    if (aFlags & OT_CHANGED_THREAD_NETDATA)
    {
        /**
         * Whenever Thread Network Data is changed, it is necessary to check if generation of global
         * addresses is needed. This operation is performed internally by the OpenThread CLI module.
         * To lower power consumption, the examples that implement Thread Sleepy End Device role
         * don't use the OpenThread CLI module. Therefore otIp6SlaacUpdate util is used to create
         * IPv6 addresses.
         */
        otIp6SlaacUpdate(thread_ot_instance_get(), m_slaac_addresses,
                         sizeof(m_slaac_addresses) / sizeof(m_slaac_addresses[0]),
                         otIp6CreateRandomIid, NULL);
    }
}


