KunYi/nRF5_SDK_Thread/examples/multiprotocol/ble_thread/ble_thread_swi_mtd_coap_cli/main.c
/**@brief Enter sending CoAP request state.
 */
static void thread_message_start_sending(void)
{
    if (m_connection_state != CONNECTION_STATE_BLE)
    {
        return;
    }

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        m_connection_state = CONNECTION_STATE_BLE_DISCONNECT;
    }
    else
    {
        m_connection_state = CONNECTION_STATE_BLE_DISABLE;
    }
}


/**@brief Send CoAP request using Thread network.
 */
static void thread_message_send(otInstance * p_instance, uint8_t command)
{
    thread_coap_utils_multicast_light_request_send(p_instance,
                                                   command,
                                                   THREAD_COAP_UTILS_MULTICAST_LINK_LOCAL);
    m_connection_state = CONNECTION_STATE_THREAD_SENT;
}


/**@brief Thread connection expired.
 */
static void thread_timeout(void * p_context)
{
    (void) p_context;

    m_connection_state = CONNECTION_STATE_THREAD_DISABLE;
}


/**@brief Execute appropriate action for current application state.
 */
static void application_fsm_process(void)
{
    uint32_t err_code;

    switch (m_connection_state)
    {
	case CONNECTION_STATE_BLE_DISCONNECT:
        err_code = sd_ble_gap_disconnect(m_conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);

        m_connection_state = CONNECTION_STATE_BLE_DISCONNECTING;
		break;

    case CONNECTION_STATE_BLE_DISABLE:
        switch_ble_to_thread();

        err_code = app_timer_start(m_thread_timeout, THREAD_TIMEOUT, NULL);
        APP_ERROR_CHECK(err_code);
        break;

    case CONNECTION_STATE_THREAD_ATTACH:
        thread_process();
        break;

    case CONNECTION_STATE_THREAD_SEND:
        thread_message_send(thread_ot_instance_get(), LIGHT_TOGGLE);
        thread_process();
        break;

    case CONNECTION_STATE_THREAD_SENT:
        err_code = app_timer_stop(m_thread_timeout);
        APP_ERROR_CHECK(err_code);

        if (!otTaskletsArePending(thread_ot_instance_get()) &&
            !otLinkIsInTransmitState(thread_ot_instance_get()) &&
             (otPlatRadioGetState(thread_ot_instance_get()) == OT_RADIO_STATE_SLEEP ||
              otPlatRadioGetState(thread_ot_instance_get()) == OT_RADIO_STATE_DISABLED))
        {
            m_connection_state = CONNECTION_STATE_THREAD_DISABLE;
        }
        else
        {
            thread_process();
            break;
        }

        // fall through

    case CONNECTION_STATE_THREAD_DISABLE:
        switch_thread_to_ble();
        break;

    default:
        break;
    }
}

/**@brief Initialize the Thread stack.
 */
static void thread_instance_init(void)
{
    uint32_t err_code;

    thread_configuration_t thread_configuration =
    {
        .role                  = RX_OFF_WHEN_IDLE,
        .autocommissioning     = true,
        .poll_period           = 60000,
        .default_child_timeout = 240000,
    };
    thread_init(&thread_configuration);
    thread_state_changed_callback_set(thread_state_changed_callback);

    m_connection_state = CONNECTION_STATE_THREAD_ATTACH;

    err_code = bsp_indication_set(BSP_THREAD_ENABLE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Initialize application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_thread_timeout, APP_TIMER_MODE_SINGLE_SHOT, thread_timeout);
    APP_ERROR_CHECK(err_code);
}

/**@brief Initialize and enable BLE stack.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

    err_code = bsp_indication_set(BSP_BLE_ENABLE);
    APP_ERROR_CHECK(err_code);

    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    m_connection_state = CONNECTION_STATE_BLE;

    NRF_LOG_INFO("BLE UART Start!\r\n");
    err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing scheduler module.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Switch from BLE to Thread.
 */
static void switch_ble_to_thread(void)
{

    ASSERT(m_connection_state == CONNECTION_STATE_BLE_DISABLE);

    ble_stack_deinit();
    thread_instance_init();
}


/**@brief Switch from Thread to BLE.
 */
static void switch_thread_to_ble(void)
{
    ASSERT(m_connection_state == CONNECTION_STATE_THREAD_DISABLE);

    thread_deinit();
    ble_stack_init();
}


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    scheduler_init();
    timers_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();

    // Start execution.
    NRF_LOG_INFO("BLE Thread switched MTD example started.");

    // Enter main loop.
    for (;;)
    {
        application_fsm_process();
        app_sched_execute();

        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
